[
  {
    "department" : "CFS",
    "code" : "160",
    "title" : "Computer Forensics Fundamentals",
    "description" : "Computer forensics involves the activities in collecting, processing, preserving, analyzing and presenting computer-related evidence in court for criminal prosecutions or civil litigations. In this course, students will be exposed to those computer forensic activities through lectures, case studies, hands-on labs, and individual and group projects. Students will study the fundamental concepts and learn essential artifacts of computer operation, internet control, digital evidence collection, and computer crime investigation, and be able to recognize as well as understand how a computer related crime or incident is prosecuted or litigated in order to have a comprehensive view of the field of Computer Forensics. This course is designed for the first year of the students majoring in Computer Forensics or the students who are interested in knowing what Computer Forensics is about.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students must be proficient in using a computer. Required skills include the ability to create directories (folders) and files of different types (plain text files, zip files, etc.) using a graphical user interface as well as a command line interface. Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-160"
  },
  {
    "department" : "CFS",
    "code" : "262",
    "title" : "Computer and Operating Systems Fundamentals I",
    "description" : "This course covers the fundamental concepts of a single user operating system. The topics discussed in the course are the basic concepts of computer organization and architecture, memory management, process handling, disk and file management and control, and peripherals operation. Students also have the opportunities to learn the techniques and procedures of system installation, configuration, administration, and trouble shooting. The operating systems illustrated in the course are MS Windows and/or Mac OS X.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 140: Computational Thinking with Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 160: Computer Forensics Fundamentals\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 265: C Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-262"
  },
  {
    "department" : "CFS",
    "code" : "264",
    "title" : "Computer and Operating Systems Fundamentals II",
    "description" : "This course covers the fundamental concepts of a multi-user operating system. The topics discussed in the course are conventional computer organization and architecture, memory management, process handling, disk and file management and control, and peripherals operation. Students also have the opportunities to learn the techniques and procedures of system installation, configuration, administration, and trouble shooting. The operating systems illustrated in the course are Linux and Unix.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 140: Computational Thinking with Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 160: Computer Forensics Fundamentals\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 265: C Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-264"
  },
  {
    "department" : "CFS",
    "code" : "280",
    "title" : "Introduction to Computer Forensics",
    "description" : "In this course, students learn the fundamental principles and concepts in computer forensics. The topics include the classification of the digital evidence, the procedure of discovering and preserving evidence, types of computer and Internet crimes, and analysis of computer crime statistics and demographics. Students also learn how to search and retrieve information to find the evidence using some common tools. Related legal procedures, regulations, and laws are also discussed briefly.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 262: Computer and Operating Systems Fundamentals I and \t\t\t\tCFS 264: Computer and Operating Systems Fundamentals II\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-280"
  },
  {
    "department" : "CFS",
    "code" : "345",
    "title" : "Electronic Discovery I",
    "description" : "In this course students learn the fundamental principles and concepts of electronic discovery including the collection, preservation, filtering, processing, review, and production of electronically stored information such as email messages, word processing documents, spreadsheets, and other computer files.  Students also learn the relationship between digital evidence analysis and electronic discovery and its role in civil litigation, government regulatory proceedings, and internal corporate investigations.  Unique issues involving electronic discovery that arise in international contexts are also addressed.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 280: Introduction to Computer Forensics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Formerly CFS 480 Introduction to Electronic Discovery.   Note:  Two information technology related courses or the instructor's consent. Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-345"
  },
  {
    "department" : "CFS",
    "code" : "350I",
    "title" : "Computer Forensic Sciences Internship",
    "description" : "Students obtain internships in selected areas of study to gain deeper understand of knowledge, skills and the context of a given field. Site supervisors give guidance and direction to customized internship projects. Faculty members serve as liaisons between the internship sites and the university, providing information to students and potential supervisors and supervising the learning experience. Students interested in internships within the Computer Science and Cybersecurity department should work with their advisor and/or faculty internship coordinator to discuss the process for your specific major.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-350i"
  },
  {
    "department" : "CFS",
    "code" : "360I",
    "title" : "Computer Forensic Sciences Student-Designed Independent Study (SDIS)",
    "description" : "Student-designed independent studies give Metropolitan State students the opportunity to plan their own study. This type of independent learning strategy can be useful for because it allows students: to study a subject in more depth, at a more advanced level;  to pursue a unique project that requires specialized study;  to draw together several knowledge areas or interests into a specialized study;  to test independent learning capabilities and skills; or to use special learning resources in the community, taking advantage of community education opportunities which, in themselves, would not yield a full college competence.\nStudents should contact their appointed advisor for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-360i"
  },
  {
    "department" : "CFS",
    "code" : "380",
    "title" : "Digital Evidence Analysis",
    "description" : "In this course, students continue not only to learn how to identify and collect digital evidence through forensics search tools, but also to study the emerging data mining techniques. The topics include how to design a plan for a computer crime investigation; how to select a computer software tool to perform the investigation; how to articulate the laws applying to the appropriation of computers for forensics analysis; how to verify the integrity of the evidence being obtained; how to prepare the evidence collected for the use in the court; and how to present the evidence as an expert eyewitness in court. Some hypothetical and real cases are also discussed in class.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 280: Introduction to Computer Forensics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-380"
  },
  {
    "department" : "CFS",
    "code" : "445",
    "title" : "Electronic Discovery II",
    "description" : "In this course students learn advanced topics and concepts of electronic discovery, such as the Electronic Discovery Reference Model, Information Governance, Technology Assisted Review, Predictive Coding, electronic discovery of cloud data, electronic discovery of social media data, electronic discovery of mobile device data and instant messages, as well as the use of software technology in electronic discovery. The course will also compare and contrast international electronic discovery issues in a global context, including common law countries and codified civil law countries.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 345: Electronic Discovery I\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-445"
  },
  {
    "department" : "CFS",
    "code" : "484",
    "title" : "Computer Laws",
    "description" : "In this course, students will learn the law relating to computer software, hardware, and the Internet. The areas of the law include intellectual property, cyberspace privacy, copyright, software licensing, hardware patent, and antitrust laws. Legislation and public policies on cyberspace technology, cryptographic method export controls, essential infrastructure protection and economic development are also discussed in class.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-484"
  },
  {
    "department" : "CFS",
    "code" : "485",
    "title" : "Mobile Device Security and Forensics",
    "description" : "This course takes a hands-on approach to provide students with foundational concepts and practical skills in Mobile Device Forensics, which can be leveraged to perform forensically sound investigations against crimes involving the most complex mobile devices currently available in the market. Using modern tools and techniques, students will learn how to conduct a structured investigation process to determine the nature of the crime and to produce results that are useful in criminal proceedings. The course will provide walkthrough on various phases of the mobile forensics process for both Android and iOS based devices including forensically extracting, collecting, and analyzing, data and producing and disseminating reports. The course modules and labs will involve certain specialized hardware and software to perform data acquisition (including deleted data), and the analysis of extracted information.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 280: Introduction to Computer Forensics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-485"
  },
  {
    "department" : "CFS",
    "code" : "492",
    "title" : "Seminar on Emerging Technologies",
    "description" : "This series of workshops is intended to provide students with hands-on experience with current and emerging technologies and tools.  Students will learn design principles and implementation practices on a variety of platforms.  Specific topics will vary.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites will vary by topic.  Instructor permission may be required prior to registration. Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-492"
  },
  {
    "department" : "CFS",
    "code" : "499",
    "title" : "Computer Forensics Internship/Capstone",
    "description" : "This course is designed to provide students an opportunity to practice what they have learned from the computer forensics program through a group project. The topic of the project must be approved by either the instructor or the director of the program. Each project must have a written report and an oral presentation. This course is recommended to be taken in the last semester of the program study.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 380: Digital Evidence Analysis and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note:  This course is offered to the students majoring in computer forensics only. Note: Students are responsible to both be aware of and abide by prerequisites for CFS and ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cfs-499"
  },
  {
    "department" : "CYBR",
    "code" : "132",
    "title" : "Security Awareness in a Digital World",
    "description" : "Cybersecurity is a critical issue for anyone who uses the Internet and that is why it is imperative to understand why safe and secure practices are essential in daily interaction with digital information and devices. This overview course discusses the foundational issues of cybersecurity from a personal to global perspective through coverage of foundational security principles, risk mitigation, and adversarial thinking as an organizing narrative for a series of other modules on data security, system security, and internet security. Practical skills such as cyber hygiene and personal device protection for personal security are also emphasized. Global and cultural issues, as well as ethical and privacy issues will be examined.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-132"
  },
  {
    "department" : "CYBR",
    "code" : "313",
    "title" : "EC-Council Certified Ethical Hacker (CEH) Certification Preparation",
    "description" : "This course's primary focus is to teach the latest commercial-grade hacking tools, techniques, and methodologies used by hackers and information security professionals to hack an organization lawfully for the sole purpose of discovering vulnerabilities. It is imperative to identify vulnerabilities in your working environment before the attackers and guide your employer towards a better overall security posture. Ethical Hacking is an in-demand skill, primarily because the best defense is a good offense.. The course will prepare students for the EC-Council CEH certification exam. The CEH certification, a well-recognized industry certification, helps students develop the necessary skills needed to work in a red team environment, focused on attacking computer systems and gaining access to networks, applications, databases, and other critical data on secured systems.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Co-requisite: CYBR 412 Vulnerability Assessment and Penetration Testing.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS/CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-313"
  },
  {
    "department" : "CYBR",
    "code" : "323",
    "title" : "CompTIA Linux+ Certification Preparation",
    "description" : "This course's primary focus is to provide targeted content and integrated hands-on skills in Linux Operating System and prepare students for the CompTIA Linux+ certification exam. The CompTIA Linux+, a well-recognized industry certification, helps students develop baseline skills needed to perform common tasks in major distributions of Linux, including the Linux command line, essential maintenance, installing and configuring workstations, and networking.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 140: Computational Thinking with Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 265: C Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 160: Computer Forensics Fundamentals\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Co-requisite: CFS264-Computer and Operating Systems Fundamentals II.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS/CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-323"
  },
  {
    "department" : "CYBR",
    "code" : "332",
    "title" : "Computer Security",
    "description" : "This course introduces principles of computer security with integrated hands-on labs. The course prepares students to effectively protect information assets by providing fundamental details about security threats, vulnerabilities, and their countermeasures ranging from a simple computer to enterprise computing. Topics include broad range of today's security challenges, common security threats and countermeasures, security management, access control mechanisms, applied cryptography, privacy issues, computer ethics, file system security, and network security. Overlap: ICS 382 Computer Security\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects and \t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 265: C Programming and \t\t\t\tICS 265: C Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 280: Introduction to Computer Forensics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Formerly: ICS 382.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS/CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-332"
  },
  {
    "department" : "CYBR",
    "code" : "333",
    "title" : "CompTIA Security+ Certification Preparation",
    "description" : "The major focus of this course is to provide targeted contents and integrated hands-on skills in cybersecurity and prepare students for the CompTIA Security+ certification exam. The CompTIA Security+, a well-recognized industry certification, helps students develop baseline skills needed to perform core security functions and pursue an IT security career.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects and \t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 280: Introduction to Computer Forensics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Co-requisite: CYBR 332 Computer Security.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS/CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-333"
  },
  {
    "department" : "CYBR",
    "code" : "343",
    "title" : "CompTIA CySA+ Certification Preparation",
    "description" : "This course's primary focus is to provide targeted content and integrated hands-on skills to apply behavioral analytics to networks and devices to prevent, detect, and combat cybersecurity threats through continuous security monitoring. The course will prepare students for the CompTIA CySA+ certification exam. The CompTIA CySA+, a well-recognized industry certification, helps students develop baseline skills needed to proactively capture, monitor, and respond to network traffic findings and emphasize software and application security, automation, and threat hunting, and IT regulatory compliance, which affects the daily work of security analysts.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Co-requisite: CYBR 442 Cyber Operations.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS/CYBR/CFS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-343"
  },
  {
    "department" : "CYBR",
    "code" : "350I",
    "title" : "Cybersecurity Individualized Internship",
    "description" : "Students obtain internships in selected areas of study to gain deeper understand of knowledge, skills and the context of a given field. Site supervisors give guidance and direction to customized internship projects. Faculty members serve as liaisons between the internship sites and the university, providing information to students and potential supervisors and supervising the learning experience. Students interested in internships within the Computer Science and Cybersecurity department should work with their advisor and/or faculty internship coordinator to discuss the process for your specific major.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-350i"
  },
  {
    "department" : "CYBR",
    "code" : "360I",
    "title" : "Cybersecurity Student Designed Independent Studies",
    "description" : "Student-designed independent studies give Metropolitan State students the opportunity to plan their own study. This type of independent learning strategy can be useful because it allows students: to study a subject in more depth, at a more advanced level;  to pursue a unique project that requires specialized study;  to draw together several knowledge areas or interests into a specialized study;  to test independent learning capabilities and skills; or to use special learning resources in the community, taking advantage of community education opportunities which, in themselves, would not yield a full college competence.\nStudents should contact their academic advisor for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-360i"
  },
  {
    "department" : "CYBR",
    "code" : "362",
    "title" : "Networking Protocols and Analysis",
    "description" : "Networks are the backbone of information technology operations within an enterprise and are responsible for a significant portion of an organization's security posture. Cybersecurity professionals are often tasked with securing network operations and responding to network threats which demonstrates the importance to networking knowledge in the cybersecurity industry. As a cybersecurity practitioner, it is imperative that there is an understanding of network operations, protocols, and administration practices. This course focuses on developing skills and taking a deep dive into networking protocols including TCP, UDP, ICMP, and IP, network design and architecture, network administration automation, network analysis, and network protocol and design impacts on security and defense measures. Overlap: ICS 383 Networking Protocols and Analysis\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 264: Computer and Operating Systems Fundamentals II\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects and \t\t\t\tICS 265: C Programming and \t\t\t\tICS 265: C Programming and \t\t\t\tICS 141: Problem Solving with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Formerly: ICS 383.  Note: Students are responsible to both be aware of and abide by prerequisites for CFS/CYBR/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-362"
  },
  {
    "department" : "CYBR",
    "code" : "363",
    "title" : "CompTIA Network+ Certification Preparation",
    "description" : "The main focus of this course is to provide targeted contents and integrated hands-on skills in telecommunication and computer networking and prepare students for the CompTIA Network+ certification exam. The CompTIA Network+, a well-recognized industry certification, helps students develop a career in IT infrastructure covering troubleshooting, configuring, and managing networks.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCFS 264: Computer and Operating Systems Fundamentals II\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Co-requisite: CYBR362 Networking Protocol and Analysis OR ICS460 Network and Security.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS/CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-363"
  },
  {
    "department" : "CYBR",
    "code" : "412",
    "title" : "Vulnerability Assessment and Penetration Testing",
    "description" : "To properly secure any organization's information infrastructure and assets, a periodic assessment of its security posture at various levels of the organization is essential.  One key area is the direct assessment of vulnerabilities in the IT infrastructure, systems and applications, followed by targeting and exploitation of the same.  This course covers the theoretical bases for cyber threats and vulnerabilities, and delves into selection and application of penetration testing methodologies ranging from reconnaissance to the exploitation of vulnerabilities by probing infrastructure, services and applications.  The course places a strong emphasis on the use of these methodologies to demonstrate, document, report on, and provide a clear roadmap for remediation of exposed security issues.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 460: Networks and Security \t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCYBR 362: Networking Protocols and Analysis and \t\t\t\tICS 383: Networking Protocols and Analysis\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Formerly: ICS 482.  Note: Students are responsible to both be aware of and abide by prerequisites for CFS/CYBR/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-412"
  },
  {
    "department" : "CYBR",
    "code" : "432",
    "title" : "Cryptography for Cybersecurity Practitioners",
    "description" : "This course provides students with a thorough foundation of applied cryptography for cybersecurity practitioners. As encryption technologies continue to integrate into everyday culture, the importance of cryptography and encryption knowledge of cybersecurity practitioners continues to increase.\n\nStudents will learn and be able to apply and analyze: the history of cryptography from the earliest ciphers to current encryption methodology, mathematical foundations for cryptography, symmetric and asymmetric algorithms, and applied cryptography pertaining to Virtual Private Networks (VPNs), SSL/TLS, strategies for defense utilizing encryption and cryptography, military applications, steganography, cryptanalysis, and more. Additionally, students will look to the future of cryptography and encryption including a look into quantum cryptography and encryption in cloud environments. Overlap: ICS 483.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tICS 382: Computer Security and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 460: Networks and Security \t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Formerly: ICS 483.  Note:  Students are responsible to both be aware of and abide by prerequisites for CFS/CYBR/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-432"
  },
  {
    "department" : "CYBR",
    "code" : "442",
    "title" : "Cyber Operations",
    "description" : "Information is an asset that must be protected. Without adequate protection or network security, many individuals, businesses, and governments are at risk of losing that asset. It is imperative that all networks be protected from threats and vulnerabilities so that a business can achieve its fullest potential. Security risks cannot be eliminated or prevented completely; however, effective risk management and assessment can significantly minimize the existing security risks.\nIn order to provide effective protection to the organization's critical infrastructure and services, continuous monitoring as well as various processes, procedures, and technology is required to detect and prevent cyber-attacks, breaches, and security violations. In addition, existence of a comprehensive incident response plan is vitally connected to the survivability of an organization after a severe security breach or compromise of critical business operations.\n \nThis course focuses on the operational aspect of managing challenges inherent in protecting a corporate network infrastructure and business information systems. The student will develop situational awareness of an organization's network and learn to manage, and maintain a defensive infrastructure that comprises of log servers, network firewalls, web application firewalls, and intrusion detection systems. Additional topics include information security operations, access control, risk management, business continuity planning, disaster recovery, and ethics. Overlap: ICS 484\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tCYBR 362: Networking Protocols and Analysis\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 383: Networking Protocols and Analysis and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Formerly: ICS 484.  Note: Students are responsible to both be aware of and abide by prerequisites for CFS/CYB/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-442"
  },
  {
    "department" : "CYBR",
    "code" : "445",
    "title" : "Cyber Incident Response and Handling",
    "description" : "As cyber breaches and intrusions continue to increase, enterprises are now looking to hire professionals who can identify and respond to breaches and incidents before they have adverse impacts on information systems and data networks. \nThis course provides an in-depth coverage of applying Digital Forensics and Incident Response methodologies and frameworks to address and manage the aftermath of security breaches or incidents with the goal of limiting the damages and reducing the recovery time and costs. The student will be able to identify, contain, eradicate and recover from an attack in an enterprise network. Topics include identifying threat actors and security breaches, analyzing artifacts and logs, restoring back the system, performing postmortem analysis, and implementing and/or modifying mitigating techniques. Overlap ICS 487\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tCYBR 362: Networking Protocols and Analysis and \t\t\t\tICS 383: Networking Protocols and Analysis\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Formerly: ICS 487.  Note: Students are responsible to both be aware of and abide by prerequisites for CFS/CYBR/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-445"
  },
  {
    "department" : "CYBR",
    "code" : "482",
    "title" : "Malware Analysis",
    "description" : "Malware infections have reached epidemic proportions with over 600 million types of infection reported to date.  Traditional antivirus techniques are not sufficient to stem the tide.  This course will introduce students to the fundamentals of malware analysis techniques which will allow them to recognize, analyze and remediate infections.  Basic static analysis techniques using antivirus scanning, hashing, string searching and other automated analysis tools will be reviewed.  Dynamic approaches using system and network monitoring will be employed to detect snooping and attempts to exfiltrate data.  Students will set up virtual workspaces, download tools and malware and analyze software in a secure environment.  Reverse engineering will be introduced.Overlap: ICS 486\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 383: Networking Protocols and Analysis and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 460: Networks and Security \t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tCYBR 362: Networking Protocols and Analysis and \t\t\t\tICS 232: Computer Organization and Architecture\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: ICS 486.  Note:  Students are responsible to both be aware of and abide by prerequisites for CFS/CYBR/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-482"
  },
  {
    "department" : "CYBR",
    "code" : "490",
    "title" : "Special Topics in Cybersecurity",
    "description" : "This course will cover specialized or emerging topics in cybersecurity that are not covered elsewhere in the Cybersecurity program. This course will provide the opportunity to keep the program current by introducing new and in-demand topics in cybersecurity.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 332: Computer Security and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Students are responsible to both be aware of and abide by prerequisites for ICS/CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-490"
  },
  {
    "department" : "CYBR",
    "code" : "498",
    "title" : "Cybersecurity Capstone I Concepts, Research and Planning",
    "description" : "This first course in a series of two course sequence is designed to assist students with ideation and planning for their final cyber security capstone project. At the end of this course, students should be able to identify and propose a concrete and well-defined problem in the field of cybersecurity. This course is a prerequisite for the CYBR 499 course. Both are required for graduation.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites and co-requisites for this course: The student must have completed core cybersecurity major requirements and a minimum of 90 earned credits prior to registering for this course OR Instructor Permission.\nNote: This course should be taken in the second last semester before the student graduates.  Students are responsible to both be aware of and abide by prerequisites for CFS/CYBR/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-498"
  },
  {
    "department" : "CYBR",
    "code" : "499",
    "title" : "Cybersecurity Capstone II - Design, Development, and Implementation",
    "description" : "This project-driven course helps students integrate and apply cybersecurity knowledge, skills, and abilities into a comprehensive experience that demonstrate their summative expression of what students have learned in the BS Cybersecurity program. Students are expected to demonstrate their mastery through independently selecting and researching a project concept, its analysis and implementation, and presentation of a final report.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 498: Cybersecurity Capstone I Concepts, Research and Planning\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisite: Successful completion of CYBR498-Capstone I course or Instructor Permission.  The student must have completed core cybersecurity major requirements and a minimum of 100 earned credits prior to registering for this course.  Note: This course should be taken the semester in which the student intends to graduate.  Students are responsible to both be aware of and abide by prerequisites for CFS/CYB/ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-499"
  },
  {
    "department" : "CYBR",
    "code" : "521",
    "title" : "Programming and Scripting",
    "description" : "This remediation course provides students with an overview of higher-level and low-level programming concepts. Specifically, C, assembly programming languages and scripting using python are discussed. Python scripting topics cover Boolean logic and Numeric Data Types, Strings, Text Files, Lists, and Dictionaries. programming structures, pointers, arrays, structure types. The students will learn how to writing and compiling c programs. The course covers how to write and debug assembly programs and utilize assembly instructions. The classes incorporate lecture with hands-on programming exercises, tests for student self-evaluation. This preparation course does not count towards credits in the graduate or undergraduate levels.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tMATH 115: College Algebra\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tMATH 120: Precalculus\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tSTAT 201: Statistics I\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 140: Computational Thinking with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-521"
  },
  {
    "department" : "CYBR",
    "code" : "611",
    "title" : "Vulnerability Discovery and Exploitation",
    "description" : "Vulnerability analysis and its connection to exploit development are core skills for one involved in cyber operations. This course covers vulnerability discovery and exploitation. The focus is to understand the pattern of vulnerabilities and attacks to allow students to experience protection, risk mitigation, and identify vulnerabilities in new contexts. Topics will include buffer overflows, privilege escalation attacks, input validation issues, vulnerability discovery (fuzzing and crash dump analysis), exploit development, and mitigations (e.g., DEP, ASLR, ¿).\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-611"
  },
  {
    "department" : "CYBR",
    "code" : "621",
    "title" : "Secure System Programming and OS Theory",
    "description" : "Understanding the Operating Systems (OS) theory and the OS security concepts is required to perform critical roles in the cybersecurity and cyber operations fields. This course exposes the students to topics of the OS theory with an emphasis on security applications. The course begins with an introduction of low-level programming, including Assembly and C. It continues with the basic Unix-like operating system Application Programming Interfaces (APIs) along with the fundamentals of OS concepts.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-621"
  },
  {
    "department" : "CYBR",
    "code" : "635",
    "title" : "Applied Cryptography",
    "description" : "This course covers cryptography from both theoretical and practical perspective. The course provides details about advanced cryptography and its applications in the cybersecurity world. Students will learn various cryptographic algorithms and protocols and their relationships from both attack and defense perspectives. Various cryptographic tools to secure contemporary networks will be discussed as well. Students should be able to use advanced cryptographic algorithms based on elliptic curve cryptography.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 641: Cyber Operations Fundamentals\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisite: CYBR641 or Instructor Permission. Admission to Graduate Program in Computer Science or Cybersecurity",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-635"
  },
  {
    "department" : "CYBR",
    "code" : "641",
    "title" : "Cyber Operations Fundamentals",
    "description" : "Cyber Operations, a more specific area of cybersecurity, is a highly technical field with a hardcore focus on both cyber offense and defense strategies. This course will provide an introduction to cyber operations fundamentals. Topics include Security fundamental principles, network architecture and security technologies, network traffic and protocol analysis, and offensive and defensive cyber operations and user experience.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisite: Admission to the MS in Cyber Operations Program or Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-641-0"
  },
  {
    "department" : "CYBR",
    "code" : "645",
    "title" : "Cyber Threat Hunting and Intelligence",
    "description" : "The course will provide students with knowledge and practical skills in the field of cyber threat hunting and intelligence that can be leveraged to defend against sophisticated network intrusions and loss of proprietary information. The course will discuss various phases of the intelligence lifecycle including developing intelligence requirements, collecting, analyzing, and disseminating information; and using cyber threat intelligence to improve security at the tactical, operational, and strategic levels.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 641: Cyber Operations Fundamentals\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-645"
  },
  {
    "department" : "CYBR",
    "code" : "650I",
    "title" : "Cybersecurity Individual Internship",
    "description" : "Students obtain internships in selected areas of study to gain deeper understand of knowledge, skills and the context of a given field. Site supervisors give guidance and direction to customized internship projects. Faculty members serve as liaisons between the internship sites and the university, providing information to students and potential supervisors and supervising the learning experience. Students should contact the Institute for Community Engagement and Scholarship (ICES) at Metropolitan State University for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-650i"
  },
  {
    "department" : "CYBR",
    "code" : "660I",
    "title" : "Cybersecurity Student Designed Independent Study",
    "description" : "Student-designed independent studies give Metropolitan State students the opportunity to plan their own study. This type of independent learning strategy can be useful because it allows students: to study a subject in more depth, at a more advanced level;  to pursue a unique project that requires specialized study;  to draw together several knowledge areas or interests into a specialized study;  to test independent learning capabilities and skills; or to use special learning resources in the community, taking advantage of community education opportunities which, in themselves, would not yield a full college competence.\nStudents should contact their academic advisor for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-660i"
  },
  {
    "department" : "CYBR",
    "code" : "665",
    "title" : "Securing Wireless and Mobile Technologies",
    "description" : "Wireless Communication and Mobile technologies have become an essential part of our daily lives. Modern cellular technologies have enabled smartphones to access fast Internet and app based services besides traditional voice communication and sending text messages. Additionally, today¿s network typically include a wide range of wireless devices, from computers and phones, to IP Cameras, smart TVs and connected appliances. As more and more communications are conducted via cellular and mobile technologies, these technologies have become critical (and continue to become more critical) to cyber operations. This course provides and in depth introduction to various wireless technologies (with a focus on cellular technology) and how data is processed and securely transmitted using these technologies and ubiquitous devices. An overview of smart phone technologies, their embedded operating systems, and mobile protocols will also be provided.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 641: Cyber Operations Fundamentals",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-665-0"
  },
  {
    "department" : "CYBR",
    "code" : "665",
    "title" : "Securing Wireless and Mobile Technologies",
    "description" : "Wireless Communication and Mobile technologies have become an essential part of our daily lives. Modern cellular technologies have enabled smartphones to access fast Internet and app based services besides traditional voice communication and sending text messages. Additionally, today¿s network typically include a wide range of wireless devices, from computers and phones, to IP Cameras, smart TVs and connected appliances. As more and more communications are conducted via cellular and mobile technologies, these technologies have become critical (and continue to become more critical) to cyber operations. This course provides and in depth introduction to various wireless technologies (with a focus on cellular technology) and how data is processed and securely transmitted using these technologies and ubiquitous devices. An overview of smart phone technologies, their embedded operating systems, and mobile protocols will also be provided.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 641: Cyber Operations Fundamentals\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-665"
  },
  {
    "department" : "CYBR",
    "code" : "671",
    "title" : "Digital Forensics I",
    "description" : "This course covers advanced topics of digital forensics procedures, legal issues, and scientific principles. The course addresses the current and new issues in digital forensics by offering various topics such as windows, smart phones, memory, network forensics, Macintosh forensics, and updated and expanded coverage on legal issues. Moreover, the students will learn how to report their findings to present them to the court using the state-of-the-art tools in digital forensics.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 641: Cyber Operations Fundamentals\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-671"
  },
  {
    "department" : "CYBR",
    "code" : "672",
    "title" : "Digital Forensics II",
    "description" : "This course covers how to conduct successful digital forensic examinations in Windows, Linux, and Mac OS, the methodologies used, key technical concepts, and the tools needed to perform examinations. The required technical details of how each operating system works and how to find artifacts is also covered.  Topics like File systems, data recovery, memory forensics, executable layouts are discussed in details. Moreover, Hands-On Network Forensics that starts with the core concepts within network forensics, including coding, networking, forensics tools, and methodologies for forensic investigations are covered.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 671: Digital Forensics I\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-672"
  },
  {
    "department" : "CYBR",
    "code" : "675",
    "title" : "Virtualization and Cloud Security",
    "description" : "Virtualization technology has rapidly expanded to become a core feature of various components of enterprise environments. It allows efficient use of physical IT infrastructure by sharing its capabilities among many users or environments. Virtualization is also an integral element to cloud computing and key technology in cybersecurity. Cloud computing provides organizations the ability to create and use IT services efficiently and rapidly without spending capital resources upfront. This course will discuss the capabilities and limitations of modern approaches to virtualization and the variety, complexity, and capabilities of modern cloud platforms and cloud security.  \n\nThe course will include hands-on lab exercises using leading Cloud infrastructure providers (ex. Amazon Web Services and Microsoft Azure). The course will review the applied concepts and techniques with end-to-end Cloud security architecture with real-world case studies using Web/Mobile based applications, and Internet of Things (IoT) application deployments on Cloud.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 621: Secure System Programming and OS Theory\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-675"
  },
  {
    "department" : "CYBR",
    "code" : "681",
    "title" : "Malware Analysis and Reverse Engineering",
    "description" : "The ubiquitous nature of Internet of Everything (IoE) and the prevalence of computing technologies in critical infrastructure sectors have brought an unprecedented digital transformation to individuals, businesses, and industries. On the other hand, the IoE has also enabled the increased spread of malicious software (malware). Malware attacks are increasing exponentially over time with total number of known malware surpassed one billion. As a result, the ability to detect, analyze, understand, control, and eradicate malware derive threat intelligence, helps provide timely response to security incidents, fortify defenses, and is essential to nation¿s economic vitality and security. \nThis course introduces malware analysis and reverse engineering techniques which will allow students to recognize, analyze and remediate infections. Using modern tools and procedures the student will understand how to dissect and reverse engineered a malware to understand its behavior, propagation, persistency, and other associated characteristics. Upon completion of the course, the students will have the reverse engineering skills necessary to understand, dissect and analyze malware.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 621: Secure System Programming and OS Theory\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-681"
  },
  {
    "department" : "CYBR",
    "code" : "690",
    "title" : "Special Topics in Cyber Operations",
    "description" : "Cyber Operations, a more specific area of cybersecurity, is a highly technical field with a hardcore focus on both cyber offense and defense strategies. This course will cover special cyber operations topics that are not covered elsewhere in the MS Cyber Operations program. This course will provide the opportunity to keep the program current by introducing new and in-demand topics in cyber operations including but not limited to SCADA, IoT/IIoT, embedded systems, hardware reverse engineering, secure software development, programmable logic and microcontroller design, RF Analysis, Software defined Networking, etc.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCYBR 641: Cyber Operations Fundamentals\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for CYBR courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-690"
  },
  {
    "department" : "CYBR",
    "code" : "698",
    "title" : "Cyber Operations Capstone Project",
    "description" : "The cyber operation capstone project is aimed at building a connection between cyber concepts and the application of these concepts into a real-world context. Students identify and develop their capstone projects throughout the graduate program and produce a serious, in-depth, scholarly and professional level written component that is reflective of their knowledge and skills that they have gained during the program. This capstone project uses a phased approach where students solidify their project ideas by the end of the first semester and complete the project with an oral defense by the end of the MS program. The final project will demonstrate students' summative expression of what they have learned in the graduate program and hence the project should be a culmination of theory, principles, best industry practices, methodologies, tools, and technologies associated with cyber operations.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisite: Graduate standing.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/cybr-698"
  },
  {
    "department" : "ICS",
    "code" : "010",
    "title" : "Symposium of Computer Forensics",
    "description" : "",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/ics-010"
  },
  {
    "department" : "ICS",
    "code" : "100",
    "title" : "Introduction to Computer Technology Concepts",
    "description" : "This course is designed for students who have limited knowledge of computer technology and applications. An overview of computer hardware, software, networking and applications throughout society forms the core of the course. Students gain an understanding of the internal workings of a computer sufficient for personal computer use or purchase. Students also consider current issues and trends in technology. Students who want hands-on experience with software should consider taking ICS 120 Microcomputer Applications in addition to this course. This is not a lab course. This course cannot be applied to the computer information technology or computer science majors.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/ics-100"
  },
  {
    "department" : "ICS",
    "code" : "120",
    "title" : "Microcomputer Applications",
    "description" : "This lab course covers how and when to use the four common components of an integrated software package:  word processing, spreadsheets, database and presentation software.  It requires no previous knowledge of computing.  Students who want an overview of computer hardware and software concepts should consider taking ICS 100 Computer Literacy in addition to this course.  This course cannot be applied to the computer information systems or computer science majors.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/ics-120"
  },
  {
    "department" : "ICS",
    "code" : "125",
    "title" : "Understanding and Using the Internet",
    "description" : "This course covers the following topics: how the Internet works (at a beginning level), social implications of the Internet, and the practical aspects of electronic mail, list services, discussion boards, file transfer, information browsing and searching, and the first generation of web design and implementation. This is a lab-based course.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Exposure to PC applications and the world-wide web.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-125"
  },
  {
    "department" : "ICS",
    "code" : "125T",
    "title" : "Understanding and Using the Internet Theory Seminar",
    "description" : "This course covers the following topics: how the Internet works (at a beginning level), social implications of the Internet, and the practical aspects of electronic mail, list services, discussion boards, file transfer, information browsing and searching, and the first generation of web design and implementation. This is a lab-based course.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites: Exposure to PC applications and the world-wide web.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-125t"
  },
  {
    "department" : "ICS",
    "code" : "140",
    "title" : "Computational Thinking with Programming",
    "description" : "An introduction to the formulation of problems and developing and implementing solutions for them using a computer. Students analyze user requirements, design algorithms to solve them and translate these designs to computer programs. The course also provides an overview of major areas within the computing field. Topics include algorithm design, performance metrics, programming languages and paradigms, programming structures, number representation, Boolean algebra, computer system organization, data communications and networks, operating systems, compilers and interpreters, cloud computing, data analytics, mobile computing, internet of things, and artificial intelligence) database, internet, security, privacy, ethics, and other societal and legal issues. Lab work and homework assignments involving flow charting tools and programming using a language such as Python form an integral part of the course.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tMATH 115: College Algebra\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tMATH 120: Precalculus\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tSTAT 201: Statistics I\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students must be proficient in using a computer. Required skills include the ability to create directories (folders) and files of different types (plain text files, zip files, etc.) using a graphical user interface as well as a command line interface. Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-140"
  },
  {
    "department" : "ICS",
    "code" : "141",
    "title" : "Problem Solving with Programming",
    "description" : "Structure, design, and implementation of object-oriented computer programs. Topics include objects, classes, GUI, and layout managers. Introduction to containment, inheritance, and polymorphism. Programming projects involving multiple classes. Emphasis on methods, parameter passing, and arrays of objects. Exploration of problem-solving and algorithm-design techniques using pseudocode, Unified Modeling Language (UML) class diagrams, and simple patterns. Design of good test cases and debugging techniques.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 140: Computational Thinking with Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 265: C Programming",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-141-0"
  },
  {
    "department" : "ICS",
    "code" : "141",
    "title" : "Programming with Objects",
    "description" : "Structure, design, and implementation of object-oriented computer programs. Topics include objects, classes, GUI, and layout managers. Introduction to containment, inheritance, and polymorphism. Programming projects involving multiple classes. Emphasis on methods, parameter passing, and arrays of objects. Exploration of problem-solving and algorithm-design techniques using pseudocode, Unified Modeling Language (UML) class diagrams, and simple patterns. Design of good test cases and debugging techniques.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 140: Computational Thinking with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Co-Requisite: MATH 215 or have taken the course prior.  Note: This class uses the Java language. Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-141"
  },
  {
    "department" : "ICS",
    "code" : "160I",
    "title" : "Information and Computer Sciences Student Designed Independent Studies",
    "description" : "Student-designed independent studies give Metropolitan State students the opportunity to plan their own study. This type of independent learning strategy can be useful because it allows students: to study a subject in more depth, at a more advanced level;  to pursue a unique project that requires specialized study;  to draw together several knowledge areas or interests into a specialized study;  to test independent learning capabilities and skills; or to use special learning resources in the community, taking advantage of community education opportunities which, in themselves, would not yield a full college competence.\nStudents should contact their academic advisor for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-160i"
  },
  {
    "department" : "ICS",
    "code" : "165I",
    "title" : "Information and Computer Sciences Prior Learning",
    "description" : "Credit for Prior Learning is the method by which students may receive college credit for prior learning obtained through nontraditional means, such as military training/experience, the workplace, or independent study. The course for which credit is being sought must correspond in its content to a course that is currently offered at Metropolitan State University. Competence is demonstrated by passing the final examination of the corresponding course.  \nStudents should contact their academic advisor for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-165i"
  },
  {
    "department" : "ICS",
    "code" : "180",
    "title" : "Java for Transfer Students",
    "description" : "This accelerated programming and design course covers the material in both ICS 140 Programming Fundamentals and ICS 141 Programming with Objects during a single semester.  It is designed for students who have experience programming in C, C++, or C#, but who need to learn the Java language.  See the descriptions of ICS 140 and ICS 141 for a list of topics covered.   Majors can substitute this course for ICS 141 Programming with Objects. Credit is not given for more than one of ICS 141 Programming with Objects, or ICS 180 Java for Transfer Students.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-180"
  },
  {
    "department" : "ICS",
    "code" : "225",
    "title" : "Web Design and Implementation",
    "description" : "This course focuses on how to design and implement information services over the Internet from the client side. The course focuses on both usability and client-side scripting. Topics include the principles, strategies and policies of web page design, including the rules of good interface design, human factors, ethical concerns and information security. Through labs and programming projects, students also learn how to use current scripting and markup languages and how to employ state-of-the-art tools to embed interactive pages into Web-based applications.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 141: Programming with Objects\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-225"
  },
  {
    "department" : "ICS",
    "code" : "232",
    "title" : "Computer Organization and Architecture",
    "description" : "Introduces machine language, digital logic and circuit design, data representation, conventional von Neumann architecture, instruction sets and formats, addressing, the fetch/execute cycle, memory architectures, I/O architectures, as well as hardware components, such as gates and integrated chips.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 265: C Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-232"
  },
  {
    "department" : "ICS",
    "code" : "240",
    "title" : "Introduction to Data Structures",
    "description" : "This course provides basic introduction to data structures and algorithms and emphasizes the relationship between algorithms and programming. Students will learn intermediate object-oriented design, programming, testing and debugging. Topics include algorithm complexity, generic programming, linked list, stack, queue, recursion, trees, searching, and sorting.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 141: Programming with Objects and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  This course uses the Java language.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-240"
  },
  {
    "department" : "ICS",
    "code" : "251",
    "title" : "IT Work Skills",
    "description" : "This course prepares students for effective employment in the IT workplace.  Through readings, activities, case studies, and assignments, the student will develop competency with interpersonal skills, teamwork, professionalism, adaptability, flexibility, communication, planning, organizing, entrepreneurial thinking, problem solving and decision-making.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects and \t\t\t\tICS 141: Problem Solving with Programming\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 265: C Programming and \t\t\t\tICS 265: C Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/ics-251"
  },
  {
    "department" : "ICS",
    "code" : "265",
    "title" : "C Programming",
    "description" : "This course is designed to provide a fast-paced exposure to the C programming language for students majoring in a computer-related discipline.  The following topics are briefly reviewed using C syntax:  looping, selection, variables, scope rules, functions and pass-by-value arguments.  New topics include pass-by-address arguments, formatted and unformatted I/O, user defined types (enum, struct, union), preprocessing directives, file handling, pointers, pointer arithmetic, string manipulation and selected library functions.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/ics-265"
  },
  {
    "department" : "ICS",
    "code" : "265",
    "title" : "C Programming",
    "description" : "This course is designed to provide a fast-paced exposure to the C programming language for students majoring in a computer-related discipline.  The following topics are briefly reviewed using C syntax:  looping, selection, variables, scope rules, functions and pass-by-value arguments.  New topics include pass-by-address arguments, formatted and unformatted I/O, user defined types (enum, struct, union), preprocessing directives, file handling, pointers, pointer arithmetic, string manipulation and selected library functions.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 140: Computational Thinking with Programming",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-265-0"
  },
  {
    "department" : "ICS",
    "code" : "266",
    "title" : "Object-oriented Programming with C++",
    "description" : "This course is designed to provide a fast-paced exposure to beginning and intermediate level C++ programming, including classes, inheritance, multiple inheritance, encapsulation, polymorphism, operator overloading and virtual functions.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/ics-266"
  },
  {
    "department" : "ICS",
    "code" : "268",
    "title" : "Rapid Application Development Using Visual Basic",
    "description" : "This course uses a project-based approach to learning the concepts and techniques of rapid application development using the Visual Basic language.  Students prototype user-friendly forms, set properties and write code.  Applications to access and update information in a database are implemented.  This is a programming course.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects and \t\t\t\tICS 141: Problem Solving with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/ics-268"
  },
  {
    "department" : "ICS",
    "code" : "311",
    "title" : "Database Management Systems",
    "description" : "Covers concepts and methods in the definition, creation and management of databases. Emphasis is placed on usage of appropriate methods and tools to design and implement databases to meet identified business needs. Topics include conceptual, logical and physical database design theories and techniques, such as use of Entity Relationship diagrams, query tools and SQL; responsibilities of data and database administrators; database integrity, security and privacy; and current and emerging trends. Use of database management systems such as MySQL. Coverage of HCI (Human Computer Interaction) topics.  Development of GUI front ends to databases with application of HCI principles to provide a high level usability experience.  Overlap: ICS 311T Database Management Systems.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 265: C Programming and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: ICS 311T Database Management Systems.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-311"
  },
  {
    "department" : "ICS",
    "code" : "311T",
    "title" : "Database Management Systems Theory Seminar",
    "description" : "Covers concepts and methods in the definition, creation and management of databases. Emphasis is placed on usage of appropriate methods and tools to design and implement databases to meet identified business needs. Topics include conceptual, logical and physical database design theories and techniques, such as use of Entity Relationship diagrams, query tools and SQL; evaluation of database management systems; responsibilities of data and database administrators; database integrity, security and privacy; and current and emerging trends. Database management systems such as MySQL are used in the course. Overlap: ICS 311 Database Management Systems.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Overlap:  ICS 311 Database Management Systems.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-311t"
  },
  {
    "department" : "ICS",
    "code" : "321",
    "title" : "Multimedia Design and Programming",
    "description" : "This course studies the principles and practices of multimedia design and production.  Students learn about planning, organizing and managing a multimedia production.  The class works through various stages of production using several multimedia authoring tools including:  screen layout and interface design; creation and modification of graphic elements; project layout, design and navigation; scripting (programming).\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 140: Computational Thinking with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-321"
  },
  {
    "department" : "ICS",
    "code" : "325",
    "title" : "Internet Application Development",
    "description" : "This course focuses on how to design and establish information services over the Internet from the server side. Topics include advanced concepts and issues on Internet architecture, server-side design strategies, current technologies and Internet security. Through labs and programming projects, students learn how to use current scripting and markup languages to build nontrivial state-of-the-art applications.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 225: Web Design and Implementation\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-325"
  },
  {
    "department" : "ICS",
    "code" : "340",
    "title" : "Algorithms and Data Structures",
    "description" : "Exploration of the design and implementation of data structures and algorithms fundamental to computer systems and applications and to software engineering.  Topics include trees, graphs, basic analysis of algorithmic complexity, fundamental questions of computability, and introduction to the algorithmic basis of intelligent systems. Programming projects.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-340"
  },
  {
    "department" : "ICS",
    "code" : "342",
    "title" : "Mobile Application Development",
    "description" : "Development of applications on mobile devices. Topics include virtual devices, layout managers, graphical user interface programming, component customization, resource files, and applications with audio and internationalization. Overview of different architectural models and comparisons. Applications will cover applications, services, content providers, and broadcast receivers, and will also utilize relational databases in the appropriate context.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 141: Programming with Objects\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-342"
  },
  {
    "department" : "ICS",
    "code" : "350I",
    "title" : "Information and Computer Sciences Individualized Internship",
    "description" : "Students obtain internships in selected areas of study to gain deeper understand of knowledge, skills and the context of a given field. Site supervisors give guidance and direction to customized internship projects. Faculty members serve as liaisons between the internship sites and the university, providing information to students and potential supervisors and supervising the learning experience. Students interested in internships within the Computer Science and Cybersecurity department should work with their advisor and/or faculty internship coordinator to discuss the process for your specific major.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-350i"
  },
  {
    "department" : "ICS",
    "code" : "352",
    "title" : "Machine Learning",
    "description" : "This course presents the key algorithms and theory of machine learning. Students will examine supervised and unsupervised learning algorithms. And they will gain an understanding of machine learning foundational concepts used in artificial intelligence, statistics and data science. Topics include learning algorithms used in recent application as autonomous vehicles, google search, and Facebook photo tags.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-352"
  },
  {
    "department" : "ICS",
    "code" : "365",
    "title" : "Organization of Programming Languages",
    "description" : "This course is a comprehensive introduction to the principal features and design of programming languages. It provides a comparative study of programming paradigms including structured programming, object-oriented programming, functional programming and logic programming. This course is a survey of programming concepts and constructs including data types, control structures, subprograms and parameter passing, nesting and scope, derived data types, input and output, and dynamically varying structures. Also covered are the principles of lexical and semantics analysis.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-365"
  },
  {
    "department" : "ICS",
    "code" : "365I",
    "title" : "Information and Computer Sciences Prior Learning",
    "description" : "Credit for Prior Learning is the method by which students may receive college credit for prior learning obtained through nontraditional means, such as military training/experience, the workplace, or independent study. The course for which credit is being sought must correspond in its content to a course that is currently offered at Metropolitan State University. Competence is demonstrated by passing the final examination of the corresponding course.  \nStudents should contact their academic advisor for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-365i"
  },
  {
    "department" : "ICS",
    "code" : "370",
    "title" : "Software Design Models",
    "description" : "The course focuses on how to design and build process, object and event models that are translatable into project specifications and design. Topics include an overview of systems analysis and design; a framework for systems architecture; design and development using data modeling; object modeling, entities, relationships, attributes, scope rules and influences; and event models, messaging and application activation.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 141: Programming with Objects and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-370"
  },
  {
    "department" : "ICS",
    "code" : "372",
    "title" : "Object-Oriented Design and Implementation",
    "description" : "System development using the object-oriented paradigm. Programming topics include: inheritance, polymorphism, dynamic linking, generics, Graphical User Interfaces, and data serialization. Use-case and state-based approaches for the discovery of conceptual classes. Design principles including the Liskov Substitution Principle, Open Closed Principle, and Stable Dependencies Principle. Design patterns such as Factory, Iterator, Adapter, Facade, Bridge, Observer, Command, State, Composite, Singleton, and Mediator. Employment of design principles, design patterns, and the Model View Controller in the design of object-oriented systems. System implementation. Refactoring. Group projects.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped  from a course if they have not met prerequisites. \nFirst day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-372"
  },
  {
    "department" : "ICS",
    "code" : "381",
    "title" : "Societal Issues in Computing",
    "description" : "This course is a writing intensive, research-oriented, in-depth study of the uses of and issues related to computers and information systems in society.  Topics include the benefits and social impact of computer technology with respect to social, political and legal issues.  Controversies and alternative points of view are evaluated on issues such as privacy vs. access to information; freedom of speech vs. control of content on the Internet; reliability and safety; the changing nature of work; and market-based vs. regulatory solutions.  Students research and write extensively on course topics.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisite:  Fulfill university general education writing requirements.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/ics-381"
  },
  {
    "department" : "ICS",
    "code" : "381T",
    "title" : "Societal Issues in Computing Theory Seminar",
    "description" : "This course is a writing intensive, research-oriented, in-depth study of the uses of and issues related to computers and information systems in society.  Topics include the benefits and social impact of computer technology with respect to social, political and legal issues.  Controversies and alternative points of view are evaluated on issues such as privacy vs. access to information; freedom of speech vs. control of content on the Internet; reliability and safety; the changing nature of work; and market-based vs. regulatory solutions.  Students research and write extensively on course topics.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Fulfill University general education writing requirements.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/ics-381t"
  },
  {
    "department" : "ICS",
    "code" : "382",
    "title" : "Computer Security",
    "description" : "This course introduces principles of computer security with integrated hands-on labs. The course prepares students to effectively protect information assets by providing fundamental details about security threats, vulnerabilities, and their countermeasures ranging from a simple computer to enterprise computing. Topics include broad range of today's security challenges, common security threats and countermeasures, security management, access control mechanisms, applied cryptography, privacy issues, computer ethics, file system security, and network security.  Overlap: CYBR 332.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects and \t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 280: Introduction to Computer Forensics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: CYBR 332.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-382"
  },
  {
    "department" : "ICS",
    "code" : "383",
    "title" : "Networking Protocols and Analysis",
    "description" : "Networks are the backbone of information technology operations within an enterprise and are responsible for a significant portion of an organization's security posture. Cybersecurity professionals are often tasked with securing network operations and responding to network threats which demonstrates the importance to networking knowledge in the cybersecurity industry. As a cybersecurity practitioner, it is imperative that there is an understanding of network operations, protocols, and administration practices. This course focuses on developing skills and taking a deep dive into networking protocols including TCP, UDP, ICMP, and IP, network design and architecture, network administration automation, network analysis, and network protocol and design impacts on security and defense measures. Overlap: CYBR 362.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 264: Computer and Operating Systems Fundamentals II\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: CYBR 362.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-383"
  },
  {
    "department" : "ICS",
    "code" : "390",
    "title" : "Future Trends for Computers and Technology",
    "description" : "This independent study emphasizes alternative futures for computers and technology in the next 20 years.  Its primary focus is the next decade covering alternative futures for computer architecture, computer hardware, computer software, computer applications, the office-of-the-future, people amplifiers and other areas of student interest.  Various forecasting techniques are used to gain awareness of possible futures.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisite:  Fulfill university general education writing requirements.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "3",
    "url" : "https://www.metrostate.edu/academics/courses/ics-390"
  },
  {
    "department" : "ICS",
    "code" : "411",
    "title" : "Big Data Storage and Processing",
    "description" : "The field of computer science is experiencing a transition from processing-intensive to data-intensive problems, wherein data is produced in massive amounts by large sensor networks, simulations, and social networks. Efficiently extracting, interpreting, and learning from these very large data sets need different storage and processing requirements compared to traditional business applications that are mostly dependent on relational database management systems. These emerging data-intensive applications require heavy read/write workloads and do not need some of the stringent schema and ACID properties that are central to relational databases. To cope with these requirements, a new genre of large-scale systems, is introduced that is called NoSQL databases. The main characteristics of NoSQL databases are that they are open source, non-schema oriented, having weak consistency properties and heavily distributed over large and clusters of commodity hardware. In this course, we will cover the basic concepts and approaches that are used by such big-data systems. Students will gain hands-on experience by solving relevant problems through projects utilizing publicly available systems. Topics covered includes: fundamentals of big data storage and processing using Hadoop, distributed file systems, and map-reduce, fundamentals of the four categories of NoSQL systems, namely kay-value stores, document stores, column stores, and graph stores. Students will implement applications using the following systems: Apache HBase, Amazon's Dynamo, Apache Cassandra, MongoDB, and Neo4J.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 311: Database Management Systems\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-411"
  },
  {
    "department" : "ICS",
    "code" : "412",
    "title" : "Computational Data Mining",
    "description" : "Data Mining involves an intelligent analysis and discovery of patterns information stored in data sets. It has gained a high attention among practitioners in a variety of industries and fields. Nowadays, almost every institution collects data, which  can  be  analyzed  in  order  to  support making  better  decisions,  improving  policies,  discovering computer network intrusion patterns, designing new drugs, detecting credit fraud, making accurate medical diagnoses, predicting imminent occurrences of important events, monitoring and evaluation of reliability to  preempt failures of complex systems, etc. In this course, the students will be exposed to data mining concepts, techniques, and software utilized in the overall process of discovering knowledge within data.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 311: Database Management Systems and \t\t\t\tICS 240: Introduction to Data Structures\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-412"
  },
  {
    "department" : "ICS",
    "code" : "425",
    "title" : "Client/Server Architectures",
    "description" : "This course is a study of scaling client/server applications enterprise-wide. The course examines why ordinary client/server tools do not scale enterprise wide, and examines the extensions necessary in DB linkage, OS extensions, and networking connections necessary for scaling. The MVC II (Model-View-Controller) design pattern and other useful design patterns will be used to explain typical architectural approaches.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Programming with Objects and \t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 225: Web Design and Implementation and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-425"
  },
  {
    "department" : "ICS",
    "code" : "432",
    "title" : "Distributed and Cloud Computing",
    "description" : "This course covers the fundamental concepts in the design and implementation of distributed computer systems, and its major branch of Cloud Computing. First, the course gives an overview of the basic concepts in the field of distributed computing, including distributed operating systems, distributed programming models, and design principles of computer clusters. Cloud computing is a major branch of distributed computing in which computing is delivered as a service over a network, whereby resources are rented, rather than owned, by an end user as a utility.  The course then covers Cloud Computing with in-depth study of its enabling technologies and main building blocks. Students will gain hands-on experience solving relevant problems through projects utilizing public cloud infrastructures including Amazon Web Services (AWS), Google App Engine, and Microsoft Azure. Topics include distributed system models and enabling technologies, computer clusters for scalable computing, virtual machines and virtualization of clusters and datacenters, design of cloud computing platforms, cloud programming and software environments (Workflow Systems, MapReduce, Spark, Google App Engine, Amazon AWS, Microsoft Azure, and emerging cloud software stacks), grid computing and resource management, and data-intensive distributed computing.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 311: Database Management Systems and \t\t\t\tICS 141: Programming with Objects\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 264: Computer and Operating Systems Fundamentals II and \t\t\t\tICS 232: Computer Organization and Architecture\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-432"
  },
  {
    "department" : "ICS",
    "code" : "440",
    "title" : "Parallel and Distributed Algorithms",
    "description" : "Covers design and development of parallel and distributed algorithms and their implementation. Topics include multiprocessor and multicore architectures, parallel algorithm design patterns and performance issues, threads, shared objects and shared memory, forms of synchronization, concurrency on data structures, parallel sorting, distributed system models, fundamental distributed problems and algorithms such as mutual exclusion, consensus, and elections, and distributed programming paradigms. Programming intensive.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 340: Algorithms and Data Structures   and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-440"
  },
  {
    "department" : "ICS",
    "code" : "441",
    "title" : "Foundations of Computing Theory",
    "description" : "This course establishes the mathematical and logical foundations of the discipline of computer science, with a concentration on the foundations of algorithmics.  The concept of Turing Machines is used throughout the course as the means to establish these foundations.  It uses these foundations to address the issues theoretically unsolvable problems, and of time and space complexity of algorithms for solvable problems.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tMATH 215: Discrete Mathematics and \t\t\t\tICS 240: Introduction to Data Structures\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note:  ICS 340 Data Structures recommended pre-requisite.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-441"
  },
  {
    "department" : "ICS",
    "code" : "450",
    "title" : "Collective Intelligence and the Web",
    "description" : "Collective intelligence is known as: collecting information about different groups of people, studying this information, and analyzing it in order to draw statistical conclusions about these groups of people. Collective intelligence is applied to several domains such as search engines, social networks, financial fraud detection, product marketing, stock market analysis, and national security. \nThe main focus of this course is on understanding the fundamentals of collective intelligence, introducing the remarkable machine learning and data mining algorithms, used in this domain, and studying real life cases such as product recommendations on Amazon, friend recommendation on Facebook, google search engine. Students will explore in depth the theoretical and technical concepts of: making recommendations, making decisions, studying and analyzing the behavior of groups of people, searching the web using web engines, and document filtering.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 225: Web Design and Implementation and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-450"
  },
  {
    "department" : "ICS",
    "code" : "452",
    "title" : "Introduction to Deep Learning",
    "description" : "Deep learning is a subset field of machine learning, concerned with solving complex problems using artificial neural networks. Deep learning algorithms learn the underlying features in data, in order to approach the human-level understanding of this data.\nIn this course students will study deep learning algorithms and their applications in computer vision, speech recognition, audio processing, and natural language processing. This course will cover the basic neural networks, deep feedforward networks, convolutional networks, recurrent networks, and recursive networks. Students will use Tensorflow platform to implement their acquired knowledge.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 340: Algorithms and Data Structures  \t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 352: Machine Learning\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-452"
  },
  {
    "department" : "ICS",
    "code" : "455",
    "title" : "Social Network Analysis",
    "description" : "This course provides an introduction to the field of social network analysis. Social network analysis is applied in different areas such as health, cyber security, information retrieval and communications. \nThe focus of this course is on network analysis and theory. This course introduces the main structural concepts of social networks, and it combines theory and practice using programming. Students will explore several examples related to social network analysis. Students will apply NetworkX  Python library in creating, manipulating, and study of the structure of social network.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures and \t\t\t\tICS 311: Database Management Systems\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-455"
  },
  {
    "department" : "ICS",
    "code" : "460",
    "title" : "Networks and Security",
    "description" : "Principles and practices of the OSI and TCP/IP models of computer networks, with special emphasis on the security of these networks.  Coverage of general issues of computer and data security.  Introduction to the various layers of network protocols, including physical, data link, network, and transport layers, flow control, error checking, and congestion control.  Computer system strengths and vulnerabilities, and protection techniques: Topics include applied cryptography, security threats, security management, operating systems, network firewall and security measures.  Focus on secure programming techniques. Programming projects.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-460"
  },
  {
    "department" : "ICS",
    "code" : "461",
    "title" : "Voice and Data Communications",
    "description" : "This course emphasizes the technical underpinnings of voice and data communication systems including engineering specifications, architectures, protocols and capacities. Relevant system design, development and operational considerations associated with deploying these communication systems are discussed.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 141: Problem Solving with Programming and \t\t\t\tICS 141: Programming with Objects and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tCFS 280: Introduction to Computer Forensics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-461"
  },
  {
    "department" : "ICS",
    "code" : "462",
    "title" : "Operating Systems",
    "description" : "Principles, techniques, and algorithms for the design and implementation of modern operating systems. Topics include operating system structures, process and thread scheduling, memory management including virtual memory, file system implementation, input output systems, mass storage structures, protection, and security. Students will implement process, memory, and file management algorithms.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 240: Introduction to Data Structures and \t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-462"
  },
  {
    "department" : "ICS",
    "code" : "470",
    "title" : "Software Engineering",
    "description" : "This course focuses on the theory and practice of effectively and efficiently building software systems that satisfy the requirements placed upon them by customers.  This course gives an overview of the software life cycle, and introduces various process models used to develop software.  Other topics include system verification and validation, software project management and software inspection.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 370: Software Design Models\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-470"
  },
  {
    "department" : "ICS",
    "code" : "470T",
    "title" : "Software Engineering",
    "description" : "This course focuses on the theory and practice of effectively and efficiently building software systems that satisfy the requirements placed upon them by customers.  This course gives an overview of the software life-cycle, and introduces various process models used to develop software.  Other topics include system verification and validation, software project management and software inspection.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 370: Software Design Models\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-470t"
  },
  {
    "department" : "ICS",
    "code" : "471",
    "title" : "Software Testing",
    "description" : "This course is designed to provide students with a solid grounding in software testing. The content is pragmatic and timely, and used by just about any major software development organization where Developers are now expected to test their code, and Testers are expected to develop automated tests. \n\nStudents will gain an understanding of contemporary foundational concepts, learn how to discover attacks applied against a real-world major commercial software system, and learn automated testing techniques and tools. Students will also gain an appreciation of the deep synthesis between testing and object-oriented programming that is integral to agile methods. \n\nThe course is designed to provide an environment that promotes a lively and rich exchange of ideas and online discussions.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 370: Software Design Models\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 372: Object-Oriented Design and Implementation\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-471"
  },
  {
    "department" : "ICS",
    "code" : "482",
    "title" : "Vulnerability Assessment and Penetration Testing",
    "description" : "To properly secure any organization's information infrastructure and assets, a periodic assessment of its security posture at various levels of the organization is essential.  One key area is the direct assessment of vulnerabilities in the IT infrastructure, systems and applications, followed by targeting and exploitation of the same.  This course covers the theoretical bases for cyber threats and vulnerabilities, and delves into selection and application of penetration testing methodologies ranging from reconnaissance to the exploitation of vulnerabilities by probing infrastructure, services and applications.  The course places a strong emphasis on the use of these methodologies to demonstrate, document, report on, and provide a clear roadmap for remediation of exposed security issues. Overlap: CYBR 412\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 460: Networks and Security \t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: CYBR 412.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-482"
  },
  {
    "department" : "ICS",
    "code" : "483",
    "title" : "Cryptography for Cybersecurity Practitioners",
    "description" : "This course provides students with a thorough foundation of applied cryptography for cybersecurity practitioners. As encryption technologies continue to integrate into everyday culture, the importance of cryptography and encryption knowledge of cybersecurity practitioners continues to increase.\n\nStudents will learn and be able to apply and analyze: the history of cryptography from the earliest ciphers to current encryption methodology, mathematical foundations for cryptography, symmetric and asymmetric algorithms, and applied cryptography pertaining to Virtual Private Networks (VPNs), SSL/TLS, strategies for defense utilizing encryption and cryptography, military applications, steganography, cryptanalysis, and more. Additionally, students will look to the future of cryptography and encryption including a look into quantum cryptography and encryption in cloud environments.Overlap: CYBR 432\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: CYBR 432.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-483"
  },
  {
    "department" : "ICS",
    "code" : "484",
    "title" : "Cyber Operations",
    "description" : "Information is an asset that must be protected. Without adequate protection or network security, many individuals, businesses, and governments are at risk of losing that asset. It is imperative that all networks be protected from threats and vulnerabilities so that a business can achieve its fullest potential. Security risks cannot be eliminated or prevented completely; however, effective risk management and assessment can significantly minimize the existing security risks.\nIn order to provide effective protection to the organization's critical infrastructure and services, continuous monitoring as well as various processes, procedures, and technology is required to detect and prevent cyber-attacks, breaches, and security violations. In addition, existence of a comprehensive incident response plan is vitally connected to the survivability of an organization after a severe security breach or compromise of critical business operations.\n \nThis course focuses on the operational aspect of managing challenges inherent in protecting a corporate network infrastructure and business information systems. The student will develop situational awareness of an organization's network and learn to manage, and maintain a defensive infrastructure that comprises of log servers, network firewalls, web application firewalls, and intrusion detection systems. Additional topics include information security operations, access control, risk management, business continuity planning, disaster recovery, and ethics.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: CYBR 442.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-484"
  },
  {
    "department" : "ICS",
    "code" : "486",
    "title" : "Malware Analysis",
    "description" : "Malware infections have reached epidemic proportions with over 600 million types of infection reported to date.  Traditional antivirus techniques are not sufficient to stem the tide.  This course will introduce students to the fundamentals of malware analysis techniques which will allow them to recognize, analyze and remediate infections.  Basic static analysis techniques using antivirus scanning, hashing, string searching and other automated analysis tools will be reviewed.  Dynamic approaches using system and network monitoring will be employed to detect snooping and attempts to exfiltrate data.  Students will set up virtual work spaces, download tools and malware and analyze software in a secure environment.  Reverse engineering will be introduced. Overlap: CYBR 482\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 383: Networking Protocols and Analysis and \t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 460: Networks and Security \t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: CYBR 482.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-486"
  },
  {
    "department" : "ICS",
    "code" : "487",
    "title" : "Cyber Incident Response and Handling",
    "description" : "As cyber breaches and intrusions continue to increase, enterprises are now looking to hire professionals who can identify and respond to breaches and incidents before they have adverse impacts on information systems and data networks. \nThis course provides an in-depth coverage of applying Digital Forensics and Incident Response methodologies and frameworks to address and manage the aftermath of security breaches or incidents with the goal of limiting the damages and reducing the recovery time and costs. The student will be able to identify, contain, eradicate and recover from an attack in an enterprise network. Topics include identifying threat actors and security breaches, analyzing artifacts and logs, restoring back the system, performing postmortem analysis, and implementing and/or modifying mitigating techniques. Overlap: CYBR 445\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 382: Computer Security\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tMATH 215: Discrete Mathematics\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Overlap: CYBR 445.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-487"
  },
  {
    "department" : "ICS",
    "code" : "490",
    "title" : "Special Topics in Information and Computer Sciences",
    "description" : "Special topics courses of current interest are offered occasionally.  Students may repeat ICS 490 under different topics for additional credit.  Some topics may have prerequisites.  See the current Class Schedule for additional information.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.  This course may be taken multiple times for credit.First day attendance is mandatory.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-490"
  },
  {
    "department" : "ICS",
    "code" : "492",
    "title" : "Seminar on Emerging Technologies",
    "description" : "This series of workshops is intended to provide students with hands-on experience with current and emerging technologies and tools.  Students will learn design principles and implementation practices on a variety of platforms.  Specific topics will vary.  ICS 492 can be taken more than once as a major elective with advisor approval.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites will vary by topic.  Instructor permission may be required prior to registration.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-492"
  },
  {
    "department" : "ICS",
    "code" : "499",
    "title" : "Software Engineering and Capstone Project",
    "description" : "This course focuses on the theory and practice of effectively and efficiently building software systems that satisfy the requirements placed upon them by customers. This course gives an overview of the software lifecycle and introduces various process models used to develop software.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 370: Software Design Models\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\tICS 372: Object-Oriented Design and Implementation\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-499"
  },
  {
    "department" : "ICS",
    "code" : "611",
    "title" : "Distributed Database Systems",
    "description" : "This course covers the fundamental issues of distributed databases with focus on data fragmentation and allocation, query optimization and transaction processing.  Topics include:  Distributed database management systems architecture and design; data fragmentation, replication, and allocation; database security, authorization and integrity control; query optimization; transaction management; distributed concurrency control and replica control; distributed object database management systems; multidatabase systems.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 311: Database Management Systems\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-611"
  },
  {
    "department" : "ICS",
    "code" : "612",
    "title" : "Database Security",
    "description" : "Database security has an immense impact on the design of today's electronic information systems. This course will provide an overview of database security concepts and techniques and discuss new directions of database security in the context of a connected commercial world. This course provides the information needed to develop, deploy and maintain a secure database solution. It exposes the pitfalls of database design, their means of identification and the methods of exploiting vulnerabilities.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Approved CourseFirst day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-612"
  },
  {
    "department" : "ICS",
    "code" : "613",
    "title" : "Introduction to Big Data Computing Systems",
    "description" : "The field of computer science is experiencing a transition from computation-intensive to data-intensive problems, wherein data is produced in massive amounts by large sensor networks, simulations, and social networks. Efficiently extracting, interpreting, and learning from very large datasets requires a new generation of data management technologies. This course gives an introduction to the Hadoop ecosystem as de facto big-data-management system and special consideration will be made to the Apache Spark data analysis framework. The fundamental concepts on which the emerging big data management systems are based are discussed first. Once a foundation is defined, technologies and algorithms that are used to work with big data sets are studied. Tentative topics covered include: distributed file system, map-reduce programming paradigm, Apache Spark basics, SparkSQL, Pig, Hive, Impala, and Scoop. The course is programming intensive and includes several programming assignment projects using the Hadoop ecosystem.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 311: Database Management Systems and \t\t\t\tICS 141: Problem Solving with Programming\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-613"
  },
  {
    "department" : "ICS",
    "code" : "625",
    "title" : "Web Services and Service-Oriented Architectures",
    "description" : "This course introduces XML technologies, web services and service-oriented architectures. Current approaches to web service design and implementation will be discussed.  Models for designing and implementing a service-oriented architecture will be discussed. Security considerations and emerging trends will be explored. Students will implement web services.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Note: Graduate standing.  Java programming experience and experience with web application development and programmatically accessing databases or instructor permission. The equivalent undergraduate courses at Metropolitan State would be ICS 240 Programming with Elementary Data Structures (in Java), ICS 325 Web Application Development and ICS 311 Database Management Systems.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-625"
  },
  {
    "department" : "ICS",
    "code" : "631",
    "title" : "User Experience and Design Thinking",
    "description" : "This course provides students with advanced knowledge and skills in designing user experience. Students learn how to discover user needs and desires, conceptualize user-centered designs, and test design solutions. Classes will cover latest industry trends, scholarship, and emerging technologies in user experience.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Admission to the Master of Science CS program, or permission of instructor.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-631"
  },
  {
    "department" : "ICS",
    "code" : "640",
    "title" : "Distributed Algorithms",
    "description" : "Study of distributed algorithms that are designed to run on networked processors and useful in a variety of applications., such as telecommunications, information processing, and real-time process control. Specific algorithms studied include leader election, distributed consensus, mutual exclusion, resource allocation, and stable property detection. Both asynchronous and synchronous systems will be covered and fault tolerance will be the major theme. Algorithms will be analyzed for complexity and proofs of corrections will be studied.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Graduate standing.  Recommended: ICS 441 Theory of Computation.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-640"
  },
  {
    "department" : "ICS",
    "code" : "650",
    "title" : "Simulation Modeling and Queuing Theory",
    "description" : "This course is the study of fundamentals of computer simulation modeling and queuing theory at graduate level.  Computer simulation can be an extremely powerful tool, yet few in industry seem well trained in the design, implementation, and interpretation of a useful simulation experiment.  The instructional materials in this course are designed to familiarize the students with the use of computer simulation and queuing theory.  Students will be taught to focus simulation studies on tractable and intractable questions, to draw conclusions from simulations results, and to bring these conclusions into appropriate domain context.  This is a hands-on course.  Students are taught simulation theory through the practice of developing models and of writing software.  Examples of application areas include: Computer Networks, Bioinformatics, Public Health Issues, Trends in Education, Trends in Industry and many, many more.  Topics include: Introduction to Simulation; Introduction to the Arena software package; Simulation Examples; Statistical Models in Simulation; Queuing theory and Models; Analysis of Simulation Data; Verification and validation of Simulation Models.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing in the MSCS program or permission of the instructor.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-650"
  },
  {
    "department" : "ICS",
    "code" : "650I",
    "title" : "Information and Computer Sciences Individual Internship",
    "description" : "Students obtain internships in selected areas of study to gain deeper understand of knowledge, skills and the context of a given field. Site supervisors give guidance and direction to customized internship projects. Faculty members serve as liaisons between the internship sites and the university, providing information to students and potential supervisors and supervising the learning experience. Students should contact the Institute for Community Engagement and Scholarship (ICES) at Metropolitan State University for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-650i"
  },
  {
    "department" : "ICS",
    "code" : "652",
    "title" : "Artificial Intelligence and Machine Learning",
    "description" : "Artificial Intelligence (AI) is the field of studying the synthesis and analysis of computational agents that act intelligently. AI has several areas of study, such as Searching, Reasoning, Learning, and Knowledge Representation.\nSearching helps the agent to reason and decide what to do, to determine the sequence of actions that will take to achieve its goals. Learning is the ability of the agent to improve its behavior based on experience. And knowledge representation is used to represent the individuals and the relationships between them, so the agent will be able to represent its own reasoning and use it to build knowledge¿ based systems. \nThis course focuses on searching algorithms, machine learning algorithms, and ontologies and knowledge¿based systems.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Admission to Computer Science and Cybersecurity graduate program or Instructor Permission.  Note: Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-652"
  },
  {
    "department" : "ICS",
    "code" : "660I",
    "title" : "Information and Computer Sciences Student Designed Independent Study",
    "description" : "Student-designed independent studies give Metropolitan State students the opportunity to plan their own study. This type of independent learning strategy can be useful because it allows students: to study a subject in more depth, at a more advanced level;  to pursue a unique project that requires specialized study;  to draw together several knowledge areas or interests into a specialized study;  to test independent learning capabilities and skills; or to use special learning resources in the community, taking advantage of community education opportunities which, in themselves, would not yield a full college competence.\nStudents should contact their academic advisor for more information.",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-660i"
  },
  {
    "department" : "ICS",
    "code" : "661",
    "title" : "Wireless Technologies",
    "description" : "This course is a Study of the theory and methodologies used in the construction of wireless networks.  Topics include: Overview of computer networks and wireless systems; cellular concepts and design fundamentals; physical layer fundamentals; data link control protocols; security related concepts including authentication and privacy with message integrity; wireless medium access control (MAC) protocols; radio resource management (power control); resource allocation and call admission control; mobility management; wireless networking; wireless LAN; wireless mobile ad hoc networks and wireless sensor networks.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Graduate standing.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-661"
  },
  {
    "department" : "ICS",
    "code" : "662",
    "title" : "Distributed System Design",
    "description" : "This course covers fundamental principles and theories on distributed and network operating systems, communication models,  Client/Server architecture, and Peer-to-Peer paradigms. Group communication, synchronization, threads, processor allocations, fault tolerance, distributed shared memory, and case studies are also introduced.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-662"
  },
  {
    "department" : "ICS",
    "code" : "664",
    "title" : "Real Time Operating Systems",
    "description" : "This course is the study of fundamentals of design and implementation of real-time operating systems.  Most embedded computer systems have dedicated microprocessors as their computational and controlling elements and run real-time operating systems.  This course covers concepts, programming languages, tools, hardware, and methodologies used in the construction of real-time operating systems and their peripheral components.  Topics include: applications of real-time operating systems; communications between PC computers and embedded systems; fundamental concepts of scheduling (multitasking and interruptions); introduction of basic hardware components used in most real-time operating systems; Hardware description language[VHDL]; and the writing of a real-time operating system [RTOS] using industrial standard C language, debugging, and loading the code to the target hardware.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Full graduate admission; if admitted conditionally, must have the undergraduate courses in the following areas: computer organization and architecture, computer operating systems, and programming proficiency in C based languages.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-664"
  },
  {
    "department" : "ICS",
    "code" : "668",
    "title" : "Cloud Forensics",
    "description" : "In this course, students will examine the scope of cloud computing and forensics as a multi-disciplinary field, including its foundations, methodologies, standards, procedures, applications, and then conduct an in-depth study and research in its challenges, impacts, and future trends through weekly exercises and discussions, extensive reading and writing, comparative analysis and research, and case studies and critiques.\n\nCompetence Statement:\nStudents in this course will study and comprehend the foundations, principles, theories, techniques and practice of this cutting edge field well enough to be able to define the scope of the field, outline the new procedures, familiar with the advanced technology, and conduct preliminary research on a self-framed emerging problem in the field.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisite: Graduate Student in Computer Science or instructor's consent.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-668"
  },
  {
    "department" : "ICS",
    "code" : "670",
    "title" : "Contemporary Issues in Software Engineering",
    "description" : "This course presents Software Engineering topics of interest to students in the graduate Computer Science program.  Topics vary with each offering of this course, but will be related to Software Engineering concepts such as verification, validation, secure systems, quality control, or formal methods.  Check the class schedule for details about topics and course prerequisites.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 470: Software Engineering\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing in the MSCS program or permission of the instructor.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-670"
  },
  {
    "department" : "ICS",
    "code" : "672",
    "title" : "Pattern-Oriented Software Construction",
    "description" : "Object-oriented design using design patterns. Topics include: Study of creational, structural, and behavioral patterns; Applications of these patterns in the design and implementation of object-oriented systems; complete analysis, design, implementation, and refactoring of online and batch systems.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Graduate Standing.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-672"
  },
  {
    "department" : "ICS",
    "code" : "682",
    "title" : "Cryptography and Computer Security",
    "description" : "This course will discuss a broad range of computer security issues related to cryptography and networks.  Students will study the design and use of cryptographic systems and analyze cryptanalytic attacks.  A history of cryptographic systems and the mathematics behind them will be covered as well.  Techniques of network security, including cryptographic techniques, will be covered.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Note:  Graduate standing in the MSCS program or permission of the instructor.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-682"
  },
  {
    "department" : "ICS",
    "code" : "684",
    "title" : "Cyberspace Security Engineering I",
    "description" : "This course is the first of a two-course series that introduces the interdisciplinary field of cyberspace security. The technical foundation for the cybersecurity defender is a particular combination of network, operating system, hardware (mobile/desktop/server) and software engineering skills, all of which are required to protect and defend modern systems, networks and information assets. Students will explore in-depth technical foundations which underpin cybersecurity threats and corresponding defenses. Through hands-on training students will gain necessary skills to begin supporting and implementing cyberspace security. This course will cover the following topics: Security and Risk Management (security governance principles, compliance, legal and regulatory issues, professional ethic, and security policies), Asset Security (information and asset classification and ownership, data security controls and handling requirements), Security Engineering (secure Engineering processes, security models, security evaluation model, security architectures and designs, cryptography, and physical security), and Communications and Network Security (secure network architecture design, secure network components, secure communication channels, and network attacks)\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-684"
  },
  {
    "department" : "ICS",
    "code" : "685",
    "title" : "Cyberspace Security Engineering II",
    "description" : "This course will be the second of a two-course series that introduces the interdisciplinary field of cyberspace security. The technical foundation for the cybersecurity defender is a particular combination of network, operating system, hardware (mobile, desktop, and server) and software engineering skills, all of which are required to protect and defend modern systems, networks and information assets. Students will explore in-depth technical foundations which underpin cybersecurity threats and corresponding defenses. Through hands-on training using Cyber Range students will gain necessary skills to begin supporting and implementing cyberspace security. This course will cover the following topics: Identity and Access Management (Physical and logical assets control, authentication, access control attacks, and access provisioning lifecycle), Security Assessment and Testing (Assessment and test strategies, security process data, and security control testing), Security Operations (Investigations, incident management, and disaster recovery, logging and monitoring, patch management and recovery strategies), and Software Development Security (understanding, applying, and enforcing software security, security in the software development lifecycle, and development environment security controls).\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 684: Cyberspace Security Engineering I\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-685"
  },
  {
    "department" : "ICS",
    "code" : "686",
    "title" : "Design of Information Assurance Systems",
    "description" : "This course is an integrated course emphasizing the design, analysis, and implementation of software information assurance system solutions by analyzing the current information infrastructures, software design, and applying software development, programming, testing, and engineering concepts.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 682: Cryptography and Computer Security\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisite:  Graduate Standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-686"
  },
  {
    "department" : "ICS",
    "code" : "688",
    "title" : "Cyber Threat Intelligence",
    "description" : "The course will provide students with foundational concepts and practical skills in the field of cyber threat intelligence that can be leveraged to defend against sophisticated network intrusions and loss of proprietary information. The course will discuss various phases of the intelligence lifecycle including developing intelligence requirements, collecting, analyzing, and disseminating information; and using cyber threat intelligence to improve security at the tactical, operational, and strategic levels.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 462: Operating Systems\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-688"
  },
  {
    "department" : "ICS",
    "code" : "690",
    "title" : "Special Topics Computer Science:",
    "description" : "This course is an in-depth study of some aspect of computer science that is not part of a regular course.  Special topics courses of current interest will be offered on an occasional basis.  Students may repeat ICS 690 for additional credit with advisor approval.  Some topics may have prerequisites.\n      \n\t\t\t\t\t\t\n\t\t\n\t\t\tPrerequisites\n\t\t\n\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tICS 462: Operating Systems\t\t\t\n\t\t\t\t\t\n\t\n\n        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            First day attendance is mandatory.Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.  This course may be taken multiple times for credit.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-690"
  },
  {
    "department" : "ICS",
    "code" : "697",
    "title" : "Graduate Research Project",
    "description" : "Project in Computer Science: study in a specific area in the field, identification, analysis, and solution of a problem with practical significance; preparation of a report and defense of the work; supervised by a resident faculty member of the department. Offered on the Pass/Fail basis only.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing.  Note:  Completion of 16 credits of graduate computer science coursework and consent of the project supervisor.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-697"
  },
  {
    "department" : "ICS",
    "code" : "698",
    "title" : "Research Seminar",
    "description" : "In this course, the student will perform the following activities:  search the literature on specific areas, read papers in a selected area, study the methodologies used in the applied computer research, write and submit a survey paper based on the reading, and make an oral presentation of the results. It should be taken no later than the second semester.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Graduate standing.  Note:  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/ics-698"
  },
  {
    "department" : "ICS",
    "code" : "699",
    "title" : "Graduate Research Thesis",
    "description" : "Original and creative research in Computer Science; preparation of a thesis and defense of the work; supervised by a resident faculty member of the department.  Offered on the Pass/Fail basis only.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Prerequisites:  Completion of 16 credits of graduate computer science coursework and consent of graduate advisor.  Note:  This course is offered to Master students in Computer Science only.  Students are responsible to both be aware of and abide by prerequisites for ICS courses for which they enroll, and will be administratively dropped from a course if they have not met prerequisites.First day attendance is mandatory.",
    "credits" : "4",
    "url" : "https://www.metrostate.edu/academics/courses/ics-699"
  },
  {
    "department" : "ICS",
    "code" : "7000",
    "title" : "CompTIA IT Fundamentals",
    "description" : "The CompTIA IT Fundamentals course is the first step in your preparation for a career as an entry-level information technology or personal computer (PC) technician, or as a launch pad for careers in areas such as cybersecurity.  Students must attend a required information session prior to being allowed to register.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Tuition Fee: Free for qualified applicants (covered by the NSA and the NSF grant).",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-7000"
  },
  {
    "department" : "ICS",
    "code" : "7001",
    "title" : "CompTIA Network+",
    "description" : "CompTIA Network+ covers the configuration, management, and troubleshooting of common wired and wireless network devices.  Also included are emerging technologies such as unified communications, mobile, cloud, and virtualization technologies.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Fees:  Free for qualified applicants (covered by the NSA and the NSF grant).",
    "credits" : "8",
    "url" : "https://www.metrostate.edu/academics/courses/ics-7001"
  },
  {
    "department" : "ICS",
    "code" : "7002",
    "title" : "CompTIA Security+",
    "description" : "In this non-credit course, you will build on your knowledge and professional experience with security fundamentals, networks, and organizational security as you acquire the specific skills required to implement basic security services on any type of computer network.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Fee: Free for qualified applicants (covered by the NSA and the NSF grant).",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-7002"
  },
  {
    "department" : "ICS",
    "code" : "7003",
    "title" : "CompTIA Cybersecurity Analyst CSA+",
    "description" : "CompTIA Cybersecurity Analyst is an international, vendor-neutral cybersecurity certification that applies behavioral analytics to improve the overall state of IT security.  CSA+ validates critical knowledge and skills that are required to prevent, detect, and combat cybersecurity threats.\n      \n\t        \n\t\t\t\n\t\t\tSpecial information\n\t\t\n\t\t\n            Fee: Free for qualified applicants (covered by the NSA and the NSF grant).",
    "credits" : "1",
    "url" : "https://www.metrostate.edu/academics/courses/ics-7003"
  },
  {
    "department" : "ICS",
    "code" : "7004",
    "title" : "MN Cyber Range Guardians",
    "description" : "The course is designed to train IT personnel that are supporting Cyber Security activities (e.g., Networks, Firewalls, IDS/IPS, Anti Malware Solutions, IT-Management, etc.) on dealing with the latest cyber security threats. During the course, the trainees will be required to monitor, investigate and mitigate security incidents that occur in real time using the MN Cyber Range's pre-defined scenarios. The scenarios are based on real-life incidents and are designed to run on our live virtual environment, allowing the trainees to experience hands-on, team-based training.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/ics-7004"
  },
  {
    "department" : "ICS",
    "code" : "7005",
    "title" : "MN Cyber Range Sentinels",
    "description" : "This course is designed to train security operations center (SOC) operators/analysts and blue teams on dealing with the latest cyber security threats. Its goal is to bring SOC teams up-to-date with the current cyber-threat landscape, including both knowledge and hands-on incident response, as well as to streamline their existing workflows and processes.",
    "credits" : "2",
    "url" : "https://www.metrostate.edu/academics/courses/ics-7005"
  }
]